12/data/attachments/6ffa9a4de35ba450.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Claire_evening_Friend_83236_8</nif:username>
            <nif:friendToBeRequested>soap_friends_3754447f-dfc3-47cd-b37d-4449d64219da</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>